{
  "exercises": [
    "asdfg hjkl; asdfg hjkl; ;lkjh gfdsa asdfg hjkl; ;lkjh gfdsa; lkjh gfdsa asdfg hjkl; asdfg hjkl; ;lkjh gfdsa asdfg hjkl; ;lkjh gfdsa; lkjh gfdsa asdfg hjkl; asdfg hjkl; ;lkjh gfdsa asdfg hjkl; ;lkjh gfdsa; lkjh gfdsa",
    "ah had lag slag ah had lag slag ah had ah had lag slag ah had lag slag ah had lag slag ah had ah had lag slag ah had lag slag ah had lag slag ah had ah had lag slag",
    "hash flash ask has hash flash ask has hash hash flash ask hash hash flash ask has hash flash ask has hash hash flash ask hash hash flash ask has hash flash ask has hash hash flash ask hash",
    "dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash",
    "lad sash flag lad sash flag lad sash flag lad sash flag lad sash lad sash flag lad sash flag lad sash flag lad sash flag lad sash lad sash flag lad sash flag lad sash flag lad sash flag lad sash",
    "fall gall hall lass fall gall hall lass fall fall gall hall lass fall fall gall hall lass fall gall hall lass fall fall gall hall lass fall fall gall hall lass fall gall hall lass fall fall gall hall lass fall",
    "glass alfalfa adds glass alfalfa adds glass alfalfa adds glass alfalfa glass alfalfa adds glass alfalfa adds glass alfalfa adds glass alfalfa glass alfalfa adds glass alfalfa adds glass alfalfa adds glass alfalfa",
    "sad shall salad sad shall salad sad shall salad sad shall salad sad shall sad shall salad sad shall salad sad shall salad sad shall salad sad shall sad shall salad sad shall salad sad shall salad sad shall salad sad shall",
    "ash glad alas ash glad alas ash glad alas ash glad alas ash glad alas ash glad alas ash glad alas ash glad alas ash glad alas ash glad alas ash glad alas ash glad alas ash glad alas ash glad alas",
    "all flask half all flask half all flask half all flask half all flask half all flask half all flask half all flask half all flask half all flask half all flask half all flask half all flask half all flask half all flask half",
    "qwert yuiop qwert yuiop; poiuy trewq poiuy trewq qwert yuiop qwert qwert yuiop qwert yuiop; poiuy trewq poiuy trewq qwert yuiop qwert qwert yuiop qwert yuiop; poiuy trewq poiuy trewq qwert yuiop qwert",
    "till quail tight yell; will those feat lake hash till quail tight yell; will till quail tight yell; will those feat lake hash till quail tight yell; will till quail tight yell; will those feat lake hash till quail tight yell; will",
    "wire this flay queue; there rail sale gypsy is wire this flay queue; there wire this flay queue; there rail sale gypsy is wire this flay queue; there wire this flay queue; there rail sale gypsy is wire this flay queue; there",
    "usher wake yaw tide; quash their light rash that usher wake yaw tide; usher wake yaw tide; quash their light rash that usher wake yaw tide; usher wake yaw tide; quash their light rash that usher wake yaw tide;",
    "slit guide tale rage; the depth quest your these slit guide tale rage; slit guide tale rage; the depth quest your these slit guide tale rage; slit guide tale rage; the depth quest your these slit guide tale rage;",
    "tale trash slide day; take urge wages wake typist tale trash slide day; tale trash slide day; take urge wages wake typist tale trash slide day; tale trash slide day; take urge wages wake typist tale trash slide day;",
    "play rest jaw quail; why fell its well peat two play rest jaw quail; why play rest jaw quail; why fell its well peat two play rest jaw quail; why play rest jaw quail; why fell its well peat two play rest jaw quail; why",
    "typed sure peep sill; ogre rate quell paw yap use typed sure peep sill; typed sure peep sill; ogre rate quell paw yap use typed sure peep sill; typed sure peep sill; ogre rate quell paw yap use typed sure peep sill;",
    "if do pit dug wary; quaff law stop lair gate here if do pit dug wary; if do pit dug wary; quaff law stop lair gate here if do pit dug wary; if do pit dug wary; quaff law stop lair gate here if do pit dug wary;",
    "go her with hit; fight tug quill day saw yippee go her with hit; fight tug go her with hit; fight tug quill day saw yippee go her with hit; fight tug go her with hit; fight tug quill day saw yippee go her with hit; fight tug",
    "zxcvb nm,./zxcvb nm,.//.,mn bvcxz /.,mn bvcxz zxcvb nm,./zxcvb zxcvb nm,./zxcvb nm,.//.,mn bvcxz /.,mn bvcxz zxcvb nm,./zxcvb zxcvb nm,./zxcvb nm,.//.,mn bvcxz /.,mn bvcxz zxcvb nm,./zxcvb",
    "by, zip wean trying stump shrink rice ping/ mail by, zip wean trying by, zip wean trying stump shrink rice ping/ mail by, zip wean trying by, zip wean trying stump shrink rice ping/ mail by, zip wean trying",
    "king fan crick, chill block. back abbot. aflame/ mix king fan crick, chill king fan crick, chill block. back abbot. aflame/ mix king fan crick, chill king fan crick, chill block. back abbot. aflame/ mix king fan crick, chill",
    "zest win, thump skunk. plain muffin, knight/ exit zest win, thump skunk. zest win, thump skunk. plain muffin, knight/ exit zest win, thump skunk. zest win, thump skunk. plain muffin, knight/ exit zest win, thump skunk.",
    "daring. choke bishop. admit twine sultan, sing/ roman daring. choke daring. choke bishop. admit twine sultan, sing/ roman daring. choke daring. choke bishop. admit twine sultan, sing/ roman daring. choke",
    "pink, nicest mate knit. groan flock, divide coop/advice pink, nicest pink, nicest mate knit. groan flock, divide coop/advice pink, nicest pink, nicest mate knit. groan flock, divide coop/advice pink, nicest",
    "vilest turbot, track snick scoot revoke. rein/ paving vilest turbot, track vilest turbot, track snick scoot revoke. rein/ paving vilest turbot, track vilest turbot, track snick scoot revoke. rein/ paving vilest turbot, track",
    "Office. Meat. Lean. Hiking. Feline. Decay. Clash. Bright. Office. Meat. Office. Meat. Lean. Hiking. Feline. Decay. Clash. Bright. Office. Meat. Office. Meat. Lean. Hiking. Feline. Decay. Clash. Bright. Office. Meat.",
    "Bump. Prank. Bate. Turnip. Bap. Aging. Aback. Wombat. Vine. Bump. Prank. Bate. Turnip. Bap. Aging. Aback. Wombat. Vine. Bump. Prank. Bate. Turnip. Bap. Aging. Aback. Wombat. Vine.",
    "Vexing. Typing. Being. Sump. Faxing. Rink. Blot. Nice. Vexing. Typing. Being. Sump. Faxing. Rink. Blot. Nice. Vexing. Typing. Being. Sump. Faxing. Rink. Blot. Nice.",
    "12345 678901234567890 0987654321 09876 54321 12345 678901234567890 0987654321 09876 54321 12345 678901234567890 0987654321 09876 54321",
    "380, 157, 062, 519.238, 406, 925, 640, 502.798, 256 380, 157, 062, 519.238, 406, 925, 640, 502.798, 256 380, 157, 062, 519.238, 406, 925, 640, 502.798, 256",
    "A1 S2 D3 F4 G5 H6 J7 K8 L9;0 91 8k 7j 6h 5g 4f 3d 2s 1a A1 S2 D3 F4 G5 H6 J7 K8 L9;0 91 8k 7j 6h 5g 4f 3d 2s 1a A1 S2 D3 F4 G5 H6 J7 K8 L9;0 91 8k 7j 6h 5g 4f 3d 2s 1a",
    "Moscow 013 Sofia 982 Nuuk 176 Riga 541 Vilnius 194 Moscow 013 Sofia 982 Nuuk 176 Riga 541 Vilnius 194 Moscow 013 Sofia 982 Nuuk 176 Riga 541 Vilnius 194",
    "32A Rome 174B Paris 985 Berlin 681 Madrid 704 Vienna 32A Rome 174B Paris 985 Berlin 681 Madrid 704 Vienna 32A Rome 174B Paris 985 Berlin 681 Madrid 704 Vienna",
    "831 Warsaw 495 Amsterdam 672 Brussels 140 Copenhagen 831 Warsaw 495 Amsterdam 672 Brussels 140 Copenhagen 831 Warsaw 495 Amsterdam 672 Brussels 140 Copenhagen",
    "640 Prague 135 Bratislava 217 Nicosia 489 Tallinn 810 640 Prague 135 Bratislava 217 Nicosia 489 Tallinn 810 640 Prague 135 Bratislava 217 Nicosia 489 Tallinn 810",
    "7.72 Helsinki 6.39 Athens 7.02 Valletta 14.2 Lisbon 87.6 7.72 Helsinki 6.39 Athens 7.02 Valletta 14.2 Lisbon 87.6 7.72 Helsinki 6.39 Athens 7.02 Valletta 14.2 Lisbon 87.6",
    "16.9 Ljubljana 0.24 Stockholm 81.3 Dublin 5.39 Oslo 71.6 16.9 Ljubljana 0.24 Stockholm 81.3 Dublin 5.39 Oslo 71.6 16.9 Ljubljana 0.24 Stockholm 81.3 Dublin 5.39 Oslo 71.6",
    "76.9 Belgrade 1.35 Reykjavik 72.0 Bern 86.4 Kiev 76.9 Belgrade 1.35 Reykjavik 72.0 Bern 86.4 Kiev 76.9 Belgrade 1.35 Reykjavik 72.0 Bern 86.4 Kiev",
    "!@#$%^&*()_+ +_)(*&^%$#@! !@#$%^&*()_+ !@#$%^&*()_+ +_)(*&^%$#@! !@#$%^&*()_+ !@#$%^&*()_+ +_)(*&^%$#@! !@#$%^&*()_+",
    ";'/ p[] 0-= =-0][p/'; ;'/ p[] =- ;'/ p[] 0-= =-0][p/'; ;'/ p[] =- ;'/ p[] 0-= =-0][p/'; ;'/ p[] =-",
    "1'1~1;1;/;,<,.>./?/;:;''''\\1,]}][{[ 1'1~1;1;/;,<,.>./?/;:;''''\\1,]}][{[ 1'1~1;1;/;,<,.>./?/;:;''''\\1,]}][{[",
    "#15 @ $56.80=17%, 15*(12+3)=15^2, 2-!=4-2 #15 @ $56.80=17%, 15*(12+3)=15^2, 2-!=4-2 #15 @ $56.80=17%, 15*(12+3)=15^2, 2-!=4-2",
    "if($totalqty == 0) {echo \"you did not order anything\"}; if($totalqty == 0) {echo \"you did not order anything\"}; if($totalqty == 0) {echo \"you did not order anything\"};",
    "if(document.images) && (prelodFlag ==)) {for var i=0 if(document.images) && (prelodFlag ==)) {for var i=0 if(document.images) && (prelodFlag ==)) {for var i=0",
    ">>> for n in [1, 2, 3]: print n; %d x 7 = %d % (j,j*7) >>> for n in [1, 2, 3]: print n; %d x 7 = %d % (j,j*7) >>> for n in [1, 2, 3]: print n; %d x 7 = %d % (j,j*7)",
    "void main() {int angle_degree; double angle_radian. pi void main() {int angle_degree; double angle_radian. pi void main() {int angle_degree; double angle_radian. pi",
    "if(chair $where){ #we got there } else { #not} if(chair $where){ #we got there } else { #not} if(chair $where){ #we got there } else { #not}",
    "if (index>=size) throw new ArrayIndexOutOfBounds if (index>=size) throw new ArrayIndexOutOfBounds if (index>=size) throw new ArrayIndexOutOfBounds"
  ]
}
