[
  "asdfg hjkl; asdfg hjkl; ;lkjh gfdsa asdfg hjkl; ;lkjh gfdsa ;lkjh gfdsa asdfg hjkl; asdfg hjkl; asdfg hjkl; asdfg hjkl; asdfg hjkl; asdfg hjkl; asdfg hjkl; asdfg hjkl;",
  "ah had lag slag ah had lag slag ah had ah had lag slag ah had lag slag ah had ah had lag slag",
  "hash flash ask has hash flash ask has hash hash flash ask hash flash ask has hash flash ask has hash flash ask has",
  "dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash dash gash lash",
  "asdfghjkl; asdfghjkl; asdfghjkl; asdfghjkl; asdfghjkl; asdfghjkl; asdfghjkl;",
  "ghfj dk sl a; ghfj dk sl a; ghfj dk sl a; ghfj dk sl a; ghfj dk sl a; ghfj dk sl a;",
  "qwer yuio qwer yuio qwer yuio qwer yuio qwer yuio qwer yuio qwer yuio qwer yuio",
  "rewq oiyu rewq oiyu rewq oiyu rewq oiyu rewq oiyu rewq oiyu rewq oiyu rewq oiyu",
  "aq sw de fr ju ki lo p; aq sw de fr ju ki lo p; aq sw de fr ju ki lo p; aq sw de fr",
  "pe ol ki uj rf ed ws qa pe ol ki uj rf ed ws qa pe ol ki uj rf ed ws qa pe ol ki uj",
  "asdf qwer jkl; yuio asdf qwer jkl; yuio asdf qwer jkl; yuio asdf qwer jkl; yuio",
  "a quick brown fox a quick brown fox a quick brown fox a quick brown fox a quick brown",
  "zxcv mnb, zxcv mnb, zxcv mnb, zxcv mnb, zxcv mnb, zxcv mnb, zxcv mnb, zxcv mnb,",
  "vcxz ,bnm vcxz ,bnm vcxz ,bnm vcxz ,bnm vcxz ,bnm vcxz ,bnm vcxz ,bnm vcxz ,bnm",
  "az sx dc fv mj nk l, az sx dc fv mj nk l, az sx dc fv mj nk l, az sx dc fv mj nk l,",
  "vb nm fg hj vb nm fg hj vb nm fg hj vb nm fg hj vb nm fg hj vb nm fg hj vb nm fg hj",
  "the lazy dog jumps the lazy dog jumps the lazy dog jumps the lazy dog jumps the lazy",
  "over the brown fox over the brown fox over the brown fox over the brown fox over the",
  "1234 5678 1234 5678 1234 5678 1234 5678 1234 5678 1234 5678 1234 5678 1234",
  "9087 6543 9087 6543 9087 6543 9087 6543 9087 6543 9087 6543 9087 6543 9087",
  "a1 s2 d3 f4 j7 k8 l9 ;0 a1 s2 d3 f4 j7 k8 l9 ;0 a1 s2 d3 f4 j7 k8 l9 ;0 a1 s2 d3",
  "The quick brown fox jumps over the lazy dog. The quick brown fox jumps over the lazy dog.",
  "Pack my box with five dozen liquor jugs. Pack my box with five dozen liquor jugs.",
  "Amazingly few discotheques provide jukeboxes. Amazingly few discotheques provide jukeboxes.",
  "How vexingly quick daft zebras jump! How vexingly quick daft zebras jump! How vexingly",
  "Bright vixens jump; dozy fowl quack. Bright vixens jump; dozy fowl quack. Bright vixens.",
  "He asked his son, 'Where are you going?' He asked his son, 'Where are you going?'",
  "She said, \"I will be there by 5:30 PM.\" She said, \"I will be there by 5:30 PM.\"",
  "The cost is $1,234.56 - that's quite a lot! The cost is $1,234.56 - that's quite a lot!",
  "Email me at: user_name@example.com. Email me at: user_name@example.com.",
  "This is a test of speed and accuracy. This is a test of speed and accuracy. This is a",
  "Practice makes perfect, so keep trying. Practice makes perfect, so keep trying. Practice."
]
