{
  "typing_tests": [
    {
      "test_number": 1,
      "title": "SSC CGL Previous Year Typing Test - 1",
      "passage": "Is positive thinking an inherent characteristic of a person or can it be developed in one's psyche? The opinions differ in answering this vital question. Some people believe that it can be inherited from parents, and cannot be developed. Others believe that like other qualities it can be developed with proper practice and guidance. Still some others hold the opinion that it is hereditary to some extent but can be acquired to some degree. There is also a section of people, who believe that all depends on circumstances or luck. We need to adopt a scientific approach to find an answer to the above question. No one can get success every time even after making efforts, nor can one fail constantly. Moreover, success has different meaning for different people. For some students, getting 60 per cent marks is success, for others it may not be sufficient. In a competitive examination, success means getting selected, whatever the percentage of marks. As for inheritance theory, since positive attitude is not a physical feature but a mental faculty, it cannot be purely hereditary. It can be developed. Moreover, parents play a major role in developing this quality of a child. A child, who watches his parents working hard, having faith in success through their words, behaviour and body language, is likely to develop a similar attitude. The children of short-tempered, over-cautious and nervous parents may assume similar characteristics when they grow up. Psychologists, therefore, prescribe a code of conduct for parents' behaviour in front of their children. They must exude confidence, self-belief and hope, especially in difficult situation, so that the children emulate these qualities. They must be taught the importance of being positive before, during and after the performance of a task. There is no better education for a child than watching his parents come out of a tough situation by means of earnest endeavours. Such success not only gives more joy but also increases self-confidence."
    },
    {
      "test_number": 2,
      "title": "SSC CGL Previous Year Typing Test - 2",
      "passage": "As the House knows, the Prime Minister sent out a circular to all the States a few years ago requesting that the portfolio of agriculture in the States should not be neglected; it should be entrusted to an important Minister. I think the National Development Council considered this question and they said that as far as possible, the Chief Ministers in the States should handle the portfolio themselves. And then, they have started a Food Production Board in the Cabinet itself at the Centre, and the National Development Council has decide that an agricultural production board should be started in each State with the Chief Minister as the Chairman. They have started an agricultural machinery board for supplying machinery. They have taken many steps in addition to the normal measures. The Government has been doing their very best in this regard. But with all that, it has not kept up with the targets fixed, unless earnest and vigorous attempts are made. I wish to throw out my own suggestions in this regard. They may not be very pleasant but I wish to be excused because I am speaking from experience. Madam, the first thing is that so far as the producing agency is concerned, its voluntary interest and its enthusiasm must be won. For instance, in industrial labour relations, we got out of the way to invite labour and give it even participation in the management and to do everything for labour. This is just to see that industrial relations are good and the industrial output will be increasing day by day. Should we not show some consideration for this producing agency, namely, the farmer? Mr. Thomas has shown how agricultural products, even at these increased prices, are not paying to the agriculturist. He has shown that very correctly, and everyone who has intimate connection with agriculture at least will agree to that, and if at all anything, that is an under-estimate, not an over-estimate. When that is so, how can we expect the farmer to produce unless he is enthused?"
    },
    {
      "test_number": 3,
      "title": "SSC CGL Previous Year Typing Test - 3",
      "passage": "Under the National Drinking Water Mission, the guinea worm problem which is prevalent in only six States will now be eliminated by the end of the current year. Similarly, the Central Government has taken several steps to remove the excess quantity of fluoride from drinking water. Alternative sources of clean drinking water and equipment to remove fluoride will be made available to the affected villages. For both the works, a special provision to provide funds to the States is being made. Public awakening campaign is being launched in this regard. The Government has taken the decision to open laboratories at all the places for the qualitative testing of drinking water. I would also like to point out that the constructed amenities provided for the disposal of dirt and dirty water are comparatively very inadequate. This issue will be taken up for discussion at an early date in the National Seminar and the policy will undergo change. I would like to mention that the World Bank and many countries of the world are: extending their assistance for the implementation of these two programmes. The programme started to make available drinking water in villages through Rajiv Gandhi National Drinking Water Mission, is the biggest in the world and has become a model for other developing countries. In order to have systematic agricultural development and to maintain it, an effective system is essential for marketing of agricultural products so that the interests of producers and consumers may be safeguarded. A model Act has been circulated to the States in order to make uniformity in the regulation and management of markets. In order to provide basic infrastructure facilities for these markets under a Centrally-sponsored programme, the committees of the trade centers are given monetary assistance to the markets through the State Government. Now, both the programmes for the development of markets and construction of village godowns have been entrusted to the State Governments."
    },
    {
      "test_number": 4,
      "title": "SSC CGL Previous Year Typing Test - 4",
      "passage": "The Bill, as passed by the Lok Sabha, is already with the hon. Members The Select Committee earlier went exhaustively into the various provisions of the original Bill and also recorded evidence from some of the representatives of the industry. The various recommendations of the select committee has been incorporated in the Bill. In addition, the wishes expressed by some of the Members of the Lok Sabha have been incorporated in the Bill. The difficulties of small growers have been apprecrated and the major portion of the acreage of rubber cultivation is held by the small growers. Proper representation to these small producers of rubber will be given. The labour representatives in the Board have been increased from three to four. The labour representatives will be selected from out of the panel of names submitted by the respective associations an important provision has been made in the Bill to enable the Board to take steps to secure better working conditions for workers engaged in the rubber industry. The present production, of rubber is about twenty thousand tons a year, the demand is increasing every year, while the supply is not keeping pace with the demand. It is proposed to fill up the gap over the short period by importing rubber. The Bill, when passed would enable the Board to import rubber and a provision has been made as to how any profits that are made out of this import of rubber should be utilised. To increase the, production of rubber, it is proposed to take up the development scheme. The details of which are being worked out. It appears that at present the small grower is at a great disadvantage, as far as the marketing of his rubber is concerned. This problem is rather difficult to solve However, provisions have been made for the Rubber Board to take up marketing of rubber also. It is hoped that the new Board will be able to tackle the problem of the small grower of rubber industry successfully. The Rubber industry has established itself as a major industry in India. India ranks high in natural rubber production."
    },
    {
      "test_number": 5,
      "title": "SSC CGL Previous Year Typing Test - 5",
      "passage": "Sir, the Press Council Second Amendment Bill was introduced by me in the last session, as I submitted in my statement which I laid on the Table of the House. I request the House to consider the Second Amendment because an Ordinance had to be issued since the life of the Council was expiring. Since the life of the present council was expiring, we had to issue the Ordinance. At this stage, I do not think have much to say because it is a very simple Bill. It is only trying to extend the life of the Press Council till the end of the year. If we are to finalize the formation of the Press Council earlier, then, of course, the present term would expire earlier. You will recall, I had said in the course of the last debate that a Committee of Members of Parliament has been working for the drafting of the second Bill, which is likely to come up before the end of this session. The Committee has been sitting and they have been able to come to their conclusions more or less. It is now in the drafting stage and I hope it will be possible for me to bring the Bill before the House soon, 1 would not like to go into the merits and demerits of the new Bill at this stage. Would only say that it is a very simple Bill extending the life of the present Council. I hope the House will approve of this at an early date so that I can go to the other House before the Budget debate is taken up. No doubt about it; it is a very simple Bill dealing with merely the term of the Press Council and giving life to the Press Council which would have otherwise expired. Do not object to the contents of the Bill. It has been my general objection that Article 123 of the Constitution, which empowers the President to promulgate Ordinances during the recess of Parliament, is a very special power. Therefore, Sir, it is an extraordinary power which has to be exercised with very great caution and care and only in an emergent situation. The First Amendment provides that Congress make no law respecting an establishment of religion or prohibiting its free exercise."
    },
    {
      "test_number": 6,
      "title": "SSC CGL Previous Year Typing Test - 6",
      "passage": "In the last few years, thanks to jobs becoming global, the importance of English has increased manifold. It has over the years become an important medium of communication, both at the international and intra-national levels. The importance of spoken English is even more, because here are many cases. Where one knows his subject well, but fails to communicate it properly. The practice of spoken English, therefore, is quite essential. Learning English in a country where it is not a native language, opens a number of opportunities for the Individual. An individual can make strides in the management ladder if he or she can speak English fluently. If your English is poor even though with brilliant business ideas, you may still find yourself languishing at the bottom of the management ladder. Your productivity will drop over a period of time since you will find difficulty in expressing your brilliant ideas. Those who can speak good English will probably usurp your ideas and get the credit for all the hard work you did. Group discussion is one of the ways to test someone's communicative skills generally before the final interview for a job. An English language trainer trains the candidates for group discussions. While training the candidates, the trainer aims at grooming the whole personality etc. He usually organizes number of mock interviews to make the candidates confident and to assess them as where they are lacking in order to fill the gap. Fear of speaking in front of groups is one of the greatest fears people have. Here, the role of a trainer is very crucial who trains the candidates in practices confidence, and how to concentrate on his or her message. The trainer begins with a strategy that includes understanding your purpose and role. Then he makes the candidate team how to structure his material into a meaningful message. English is a West Germanic language in the Indo-European language family, with its earliest forms spoken by the inhabitants of early medieval England."
    },
    {
      "test_number": 7,
      "title": "SSC CGL Previous Year Typing Test - 7",
      "passage": "The Habit of Reading: Studying is the main source of knowledge. Books are indeed never failing friends of man. For a mature mind, reading is the greatest source of pleasure and solace to distressed minds. The study of good books ennobles us and broadens our outlook. Therefore, the habit of reading should be cultivated. A student should never confine himself to his schoolbooks only. He should not miss the pleasure locked in the classics, poetry, drama, history, philosophy etc. We can derive benefit from other's experiences with the help of books. The various sufferings, endurance and joy described in books enable us to have a closer look at human life. They also inspire us to face the hardships of life courageously. Nowadays there are innumerable books and time is scarce. So we should read only the best and the greatest among them. With the help of books we shall be able to make our thinking mature and our life more meaningful and worthwhile. A Visit to an Exhibition: Recently, an exhibition 'Building A New India' was held in the capital. It was organized by the Ministry of Information and Broadcasting, Government of India. The exhibition was set up in the Triveni Kala Sangam. The chief exhibits were photographs, novels, some sculptures by Indian modern artists presenting Indian cultural inheritance. First of all, I visited the general section of the exhibition where different charts and photographs depicting India's development in various fields were set. Most impressive photographs among these were those showing India's nuclear development. The second section dealt with India's magnificent historical background. I was fascinated by the pictures of Mohanjodaro excavation. Then I saw the most beautiful and colorful section of the exhibition i.e. the cultural section. It consisted of paintings, sculptures, photographs etc. The Rajasthani and Gujarati paintings were very colourful and attractive. This exhibition, inaugurated by the Prime Minister, lasted for a week."
    },
    {
      "test_number": 8,
      "title": "SSC CGL Previous Year Typing Test - 8",
      "passage": "My Favorite Teacher: A teacher is called builder of the nation. The profession of teaching needs men and women with qualities of head and heart. There are many teachers in our school and a large number of teachers among them are highly qualified. I have great respect for all of them. Yet I have a special liking for Miss Y. Miss Y is a woman of great principles. She is jewel among all the teachers. Almost all the students respect her. She teaches us English. She is quite at home in this subject. She takes keen interest in teaching students. Simple living and high thinking is her motto. She is a woman of sweet temper and is always ready to help in difficulties. She treats us like her own brothers and sisters. She is an ideal teacher. It is these qualities of head and heart that have endeared Miss Y to the students and teachers alike. She is an ideal teacher in real sense of the word. She is the real model to emulate. May she live as long as there is sweet fragrance in the flowers? When My Teacher Scolded Me: Scolding is something common in student life. Being a naughty boy, I am always scolded by my parents. But one day I was severely scolded by my English teacher. She infect teaches well. But that day, I could not resist the temptation that an adventure of Nancy Drew offered. While she was teaching, I was completely engrossed in reading that book. Nancy Drew was caught in the trap laid by some smugglers and it was then when I felt a light tap on my bent head. The teacher had caught me red handed. She scolded me then and there and insulted me in front of the whole class. I was embarrassed. My cheeks burned being guilty conscious. When the class was over, I went to the teacher to apologize. When she saw that I had realized my mistake, she cooled down and then told me in a very kind manner how disheartening it was when she found any student not paying attention. I was genuinely sorry and promised to myself never to commit such a mistake again."
    },
    {
      "test_number": 9,
      "title": "SSC CGL Previous Year Typing Test - 9",
      "passage": "The Saddest Day of My Life: Days are not of equal value in one's life. Some bring happiness while others bring sadness. Sadness and happiness both are equally important to man's life, since they are the two sides of a coin. As we cannot forget the happiest day, we are unable to forget the saddest day of our life too. The saddest day of my life was the Diwali Day. Diwali is considered to be a happy festival and till last Diwali, it was my favorite festival. On last Diwali, my sister, my brother and I were busy lighting the fireworks. I was holding a 'fuljhari' in my hand and unfortunately my younger brother, who was standing just beside me, had a cracker in his hand. This cracker caught fire and a very loud explosion was heard which shook my sister and me. After that, we all could think of nothing else than blood stained cotton, bandage, dettol etc. My cousin took my brother to the doctor where he got 14 stitches in his forefinger and thumb. But at home, everybody kept cursing and blaming me for the mishap. That night, I could not sleep and I cried a lot. For next few days, I bore the burden of this blame for being responsible for this unfortunate incident. I felt deeply guilty conscious which I was able to overcome after a long time. Life Is Action, Not Contemplation: Life offers many opportunities to us to succeed and see it closely. But action is required for it. Goethe, a German philosopher rightly remarked that 'Life is action, not contemplation'. Even Charles Darvin proved that this life is a continuous struggle for the 'survival of the fittest'. One who is not suitable perishes - this is nature's law. Action is necessary to adjust ourselves in any possible circumstances. Dreams are the necessary propellers but life itself is not merely a dream or reverie. Sitting on a chair, brooding, man would never have been able to reach the moon. But man thought, imagined and strove. Consequently we reached the hitherto unknown heights. Thus a life of thought and reflection will be futile if man does not try to make it come true in real life."
    },
    {
      "test_number": 10,
      "title": "SSC CGL Previous Year Typing Test - 10",
      "passage": "Banwarilal is a simple soul who believes whatever he is told. The village boys are aware of this and exploit his simplicity for a few laughs. One day, Banwarilal is on his way to the market with his son to sell their donkey. He comes across some village boys out to have fun. Seeing the father and son duo walking with the donkey, they first suggest that let the son ride on the donkey and save the effort. The son is put on the donkey's back. The boys then ridicule the boy for riding while the father walks. The father and son switch places. The father rides while the son walks. The boys then taunt the father for making the poor son walk and advise the duo to ride the donkey together. Thinking it a good idea they comply. The poor donkey collapses from exhaustion. The boys then express their disgust at the duo for ill-treating the donkey and advice that they take the donkey to an animal doctor. The duo again follows the advice. On the way, they come across barking stray dogs. In the confusion that ensues, the donkey falls into the flowing river. The donkey is lost forever. Banwarilal loses the donkey because he follows what he is suggested without thinking for himself. Moral: He who listens to everybody will only become a laughing stock. One hot day, a thirsty crow flew all over the fields looking for water. For a long time, he could not find any. He felt very weak, almost lost all hope. Suddenly, he saw a water jug below the tree. He flew straight down to see if there was any water inside. Yes, he could see some water inside the jug! The crow tried to push his head into the jug. Sadly, he found that the neck of the jug was too narrow. Then he tried to push the jug to tilt for the water to flow out, but the jug was too heavy. The crow thought hard for a while. Then, looking around it, he saw some pebbles. He suddenly had a good idea. He started picking up the pebbles one by one, dropping each into the jug. As more and more pebbles filled the jug, the water level kept rising. Soon it was high enough for the crow to drink. His plan had worked! Moral: Think and work hard, you may find solution to any problem."
    },
    {
      "test_number": 11,
      "title": "SSC CGL Previous Year Typing Test - 11",
      "passage": "French Revolution: At the beginning of the eighteenth century, France was a monarchy ruled by an autocratic king. The French society was divided into three Estates, or classes. The First Estate consisted of the clergy. The Second Estate consisted of the nobility. The Third Estate consisted of the peasants and the bourgeoisie, which included professionals and the wealthy merchants. The First and Second Estates enjoyed many privileges, and paid almost no taxes. Wealth was concentrated in their hands. The Third Estate had no privileges. This Estate bore the burden of taxation. The peasants had to perform unpaid compulsory services. Tax default was punished with imprisonment in the state prison called the Bastille, which became a symbol of oppression. Inspired by the democratic ideas of French philosophers like Rousseau, Voltaire and Montesquieu, the bourgeoisie demanded political rights and government by the consent of the people. Estates-General France had an assembly called the Estates-General, meant to represent all the three Estates. The Estates-General, however, was never summoned between 1614 and 1789. Benazir Bhutto: Benazir was assassinated on December 27, 2007 in Rawalpindi by the Islamic terrorists, when she was addressing one of the election meetings due to be held soon afterwards. Her death postponed the elections; the Pakistan People's Party triumphed at the polls thereby shattering the dream of Nawaz Sharief of the Muslim League to occupy power. Zardari, in his earlier avatar as Consort of Benazir, earned nickname of Mr. 10%. Lo & behold, Mr. 10% now becomes head of the State. Zardari has visited a number of countries in his quest to seek foreign financial assistance and military assistance to defeat the Taliban. The monster created by Pakistan refuses to vanish and is now determined to destabilize the country and bring down the entire superstructure. The Swat Valley in early 2009 was occupied by the Islamic militants before they were ousted by a determined army action."
    },
    {
      "test_number": 12,
      "title": "SSC CGL Previous Year Typing Test - 12",
      "passage": "Climate Change: The climate is the commonly considered to be the weather averaged over a long period of time, typically 30 years. Somewhat more precisely, the concept of \"climate\" also includes the statistics of the weather-such as the degree of day-to-day or year-to-year variation expected. The Inter-governmental Panel on Climate Change (IPCC) glossary definition is: Climate in a narrow sense is usually defined as the \"average weather\", or more rigorously, as the statistical description in terms of the mean and variability of relevant quantities over a period of time ranging from months to thousands or millions of years. The classical period is 30 years, as defined by the World Meteorological Organization (WMO). These quantities are most often surface variables such as temperature, precipitation, and wind. The factors that determine the climate at a location are the rainfall, sunshine, wind, humidity and temperature. Climate change refers to long term changes in climate including overage temperature and precipitation. Earth's climate is changing and this is causing great concern. The changes place in the atmosphere have become one of the serious threats that world faces today. Human activities have the potential to disturb the balance of natural systems and cause warming of the plant to an unprecedented extent. Some of these countries are increasing the greenhouse gases emission to an extent that nature system is now not able to assimilate these gases. As a result, climate change has started endangering biodiversity, food and fresh water supply, impacting human health worldwide, especially in developing countries like India due to low adaptive capacity. Indias climate can be classified as a hot tropical country, except the northern states of Himachal Pradesh and Jammu & Kashmir in the north and Sikkim in the northeastern hills, which have a cooler, more continental influenced climate. In most of India summer is very hot. In India, summer, winter, and the rainy season are considered to be the main seasons. We also divide the year into six seasons, namely, vasant, grishma, varsha, sharad, hemant and shishir."
    },
    {
      "test_number": 13,
      "title": "SSC CGL Previous Year Typing Test - 13",
      "passage": "Value of Science: The present era is the era of science. Science has undoubtedly done a great service to mankind. Man, a rational being, has been curious to explore mysteries of nature and this led to many discoveries being made in various part of the world. But he is never satisfied with the acquired knowledge and is always keen to unravelle mysteries of the universe. He has conquered the land and air. His incredible lust for knowledge has revolutionised human life and raised the standard of life. He was able to invent innumerable ways of making his life comfortable and happy. Every sphere of life has been revolutionized by science. There have been innumerable inventions. One of the greatest inventions is the invention of medicines. There has been a series of tests carried out using animals as subjects and various medicines have been tried out on these animals to check their efficacy. Many fatal diseases can now be cured because we have the drug to fight those diseases. It has reduced the rate of infant mortality and increased the life span. Before these inventions millions of people died for lack of medical care. Science has given us many machines that have made our lives very comfortable. Buses, cars, sewing machines, mixies, grinders, etc. are all machines that are used every day by us and the discovery of electricity has made it possible for us to change night into day and summer into a comfortable cool season. It is now easy to cultivate fields as we have tractors. New forms of irrigation are now being employed. It is easier to protect the crops because of the use of various chemicals and pesticides. Even mosquitoes can be driven away because of the discoveries made in science. It has enabled man to entertain himself in many ways. TV, radio, video and the cinema are all popular means of entertainment. Besides entertainment they educate the masses. Today the computer has made life even easier for us. The press, the means of communication, etc. have all improved because of science and its gifts to us."
    },
    {
      "test_number": 14,
      "title": "SSC CGL Previous Year Typing Test - 14",
      "passage": "Mobile phones are the little wonders of the 21st century they have revolutionized and transformed our lives completely. Mobile revolution is the story of the creation of a mobile market and worldwide services, exploring new possibilities of transforming how we will live, work and play. The mobile phones have undertaken a fascinating journey from worldwide internet messaging content and multimedia messaging to camera phones, to location based services, mobile phone televisions, 3G phones etc. Mobile revolution is not only mind-boggling but also quite dramatic with the rapid pace of change in technology. Today, life without mobile phones is not only unimaginable but also unlikely. The conventional land lines, cumbersome and outdated, appear redundant and obsolete in comparison to these handy little gadgets. Gone are the days, when you needed a telephone directory in order to look for the phone number, you wish to dial. The utility of these sleek little phones is such that even if one has the option of using a land line one usually prefers to use this amazing device because of its easy accessibility. With advancement in science and technology, every new model which comes in the market is superior to its previous one, with more options and wider range of services. It provides access to entertainment and opens up a vast new world of information, work and play, so comprehensive, immediate and useful that one wonders how one can get along without it and how one had functioned so long without this utility. Multitude of internet based services is also available on these hand sets on which one can down load any music, video game and so on. Today, one can buy tickets over a phone but soon phones could become the payment method itself. There is no doubt that today India is one of the large consumers of mobile phones witnessing one of the greatest electronic revolutions of our times. Mobile phones have amazingly and interesting impacted our lives as they allow us to walk away with them and to own ourselves completely, most importantly they are very intimate and ha an extra-ordinary reach. However, it is just the beginning of a new way life and still the possibilities are immense and perhaps beyond our imagination today."
    },
    {
      "test_number": 15,
      "title": "SSC CGL Previous Year Typing Test - 15",
      "passage": "Whatever might be the origin of science and religion, the main point is their area of activity and their method of working. Science makes a man rational and free-minded. Religion wants man to believe blindly in what he is told to be true and worthy of being practiced. Science asks questions and puts every thesis or proposal to test. Religion abhors such methods. Science believes in logical experiments and wants to declare something truthful and true if it comes out finally resultant of the experiment. Religion pre-supposes the result and wants to stick to it irrespective of the outcome of investigation, inquiry or experiment. So, religion and science both are complementary to each other. For mankind, both are required in equal measure and simultaneously. Thus intrinsically, both are essential for man. The role of education as an agent or instrument of social change and social development is widely recognised today. Social change may take place: (i) When human needs change. (ii) When the existing social system or network of social institutions fail to meet the existing human needs, and (iii) When new materials suggest better ways of meeting human needs. Social changes do not take place automatically or by themselves. As Maclver says, social change takes place as a response to many types of changes that take place in the social and non-social environment. Education can initiate social changes by bringing about a change in outlook and attitude of man. It can bring about: a change in the pattern of social relationships and thereby it may cause social changes. There was a time when educational institutions and teachers were engaged in transmitting a way of life to the students. During those days, education was more a means of social control than an instrument of social change. Modern schools, colleges and universities do not place much emphasis; upon transmitting a way of life to the students. The traditional education was meant for an unchanging, static society, not marked by rapid changes."
    },
    {
      "test_number": 16,
      "title": "SSC CGL Previous Year Typing Test - 16",
      "passage": "Mass Communication in India. Radio, T.V., films, newspapers, and periodicals, etc. are the various forms of the mass media and communication. The importance of these can hardly be overemphasized. T.V., films, newspapers, and periodicals, etc. are the various forms of the mass media and communication. The importance of these can hardly be overemphasized. They play a vital role in dissemination of knowledge and information, formation of public opinion, national integration and removal of superstition. The urgency and importance of multi-channels of mass communication for a country like India, with a population of more than a billion, is clear. Radio broadcasting started in India in 1927, in Mumbai and Kolkata. Since then it has spread as a vast network, covering almost all the villages, hamlets, towns and cities. It was christened Akashvani in 1957. Now, there are over 100 stations of All India Radio, serving as very effective means of communication, education and entertainment. Radios and transistors are very popular as they are cheap, handy and affordable. Over 95% of our population is covered by its vast network of stations and broadcasting centres. Now there are about 273 bulletins for duration of 37 hours in its regional, national and external services. It is one of the biggest news organisations of its kind in the world. There are 78 news bulletins in 19 languages in home service from Delhi alone. Then there are 127 regional bulletins in 62 languages. In the external air service, bulletins in 67 languages and dialects are broadcast every day. Besides, there are sports bulletins, special bulletins, weather and Parliament bulletins. There are hosts of other, very useful bulletins, commentaries and broadcasts to cover events, people, news, and views of national and international importance. Yuvak Vain is a programme for the youth of the nation, by the young men and women of the country, between the ages of 15 and 30. For school students most of the AIR stations have regular programmes, based on their school curriculum."
    },
    {
      "test_number": 17,
      "title": "SSC CGL Previous Year Typing Test - 17",
      "passage": "Television came to India in 1959, with three days a week limited transmission. However, from 1965 these became regular. Since 1976 when Doordarshan came into being, it has emerged as a very powerful and effective means of mass communication. It has seen a phenomenal growth of installation of one transmitter a day in 1984 and after. A vast network of over 350 transmitters of the Doordarshan now reaches an estimated 80% of our population. The popularity of television is on the increase and soon it will cover the entire population of our country. In order to cater to the wide interests of large sections of our population, more channels are being added and introduced. The introduction of the Metro channel in 1984 in Mumbai, Kolkata and Chennai has been historical. Now, it is available in many cities and towns. The services of Doordarshan for school and university education have helped a lot in the promotion of education and training. The satellite communication has really revolutionised the means of mass communication and information. The radio and television broadcasts via satellites have made communication instant and universal. It has turned the whole world into a global village. Now viewers have access to more and greater selection of viewing on T.V. The implications of satellite communication are really very complex, varied and far-reaching. It has its own inherent strengths and weaknesses, which are unfolding with the passage of time. But it is beyond any shadow of doubt that satellite communication will go a long way in helping a developing country like India in overcoming its many socioeconomic problems and in the achievement of development goals. The Supreme Court judgment asking the Central Government to establish an independent public authority to control and regulate the use of electronic media is a welcome decision. It implies that freedom of speech applies not just to the print but also to the electronic media. This judgment marks a new, bold and significant beginning in liberating electronic media from government control and monopoly."
    },
    {
      "test_number": 18,
      "title": "SSC CGL Previous Year Typing Test - 18",
      "passage": "The influence of films on Indian masses, means of mass communication, has been vast and abiding. The popularity of films is unquestionable. Hundreds of feature films and documentaries are made every year in India. Our film industry is one of the biggest in the world. In spite to its commercialism, its appeal and popularity is vast, abiding and immediate. It has tremendous possibilities but we should see to it that its box office aspects are not allowed to run riot. The Indian film industry should not forget its social and moral obligations. The industry should be precise, clear and sure about its scope, purpose and objectives. Similarly, the government should have no aphorism in respect to its policy in regard to the control, purpose and regulation of the industry. The multiplicity of authorities, which have a say in the industry, should be removed so as to provide healthy growth to the film industry. Moreover, censorship should be more liberal in its approach to films produced and screened. But filmmakers should avoid too much sex and violence in their films. They should aim at healthy entertainment and desirable social and cultural change through this popular means of communication. Freedom of speech and expression is very significant in a democracy. It includes the freedom of the films, the press, and broadcasting, etc. In other words, freedom of speech and expression means autonomy of the media. But autonomy also involves greater accountability. It means that there should be no loss of credibility. But commercialisation of mass media without proper safeguards can be dangerous. There is a lot of money in different media and there is the possibility of misuse of the media for personal gains. Autonomy of mass media is desirable but it is also desirable that it is self-regulatory and self-disciplined so as not to come into pressures and that it fulfills its commitments to values and ideals enshrined in our Constitution. Rights and duties go together."
    },
    {
      "test_number": 19,
      "title": "SSC CGL Previous Year Typing Test - 19",
      "passage": "The word 'Kashmir' is derived from the Sanskrit word meaning Land of Kashyap. Rishi Kashyap was one of the Saptarishis who was a Saraswat Brahmin and formalized the ancient Historical Vedic Religion. His descendants or the Kashmiri Pandits as they are commonly known named the valley in his honor. Kashmir falls in the northwestern region of the Indian subcontinent. The geographical denotions of Kashmir include the valleys between the Great Himalayas and the Pir Panjal Mountain range, until the mid-19th century. At present, it also includes the larger area of Indian-administered state of Jammu and Kashmir comprising of the three divisions of Kashmir valley, Jammu and Ladakh. Kashmir shares its borders with Pakistan as well as China. Kashmir region has been a center of Hinduism, Buddhism followed by Kashmir Shaivism. Shah Mir became the first Muslim ruler of Kashmir in 1349 inaugurating the Salatin-i-Kashmir. Muslim monarchs continued to rule Kashmir over next five centuries. Mughals ruled from the period of 1526 until 1751, after which Afghans ruled forming the Durrani Empire from 1747 until 1820. Thereafter the Sikhs, under the leadership of Ranjit Singh captured Kashmir. The Dogras became the rulers under Gulab Singh after signing the 'Treaty of Amritsar' through which they purchased the region from British rule in 1846. Dogra rule continued until India got its independence from British rule after which it became a disputed territory. Kashmir now falls into the administration of three countries: Pakistan, India and People's Republic of China. The upsurge of militancy and political movements has impacted the economy of the state greatly. The crown of India as it is popularly known for its beauty and the geographical location with respect to the country's other states has been a victim of terrorism. All sectors of the economy, of which agriculture is the pre-dominant have been affected by the frequent turbulences and failed to provide food and life security to the population of the valley."
    },
    {
      "test_number": 20,
      "title": "SSC CGL Previous Year Typing Test - 20",
      "passage": "Assam, known as the land of blue hills and red river, is also a land of many feasts and festivals, which are marked by music, dance, mirth, gaiety, community sharing, and spiritual colouring. Among these, Bihu is the most impressive and prominent. Bihu is the chief festival of the people of Assam celebrated by everyone irrespective of caste, creed, and race. Assamese celebrate three types of Bihus in a year- Rongaali Bihu or Bohaag Bihu, Kati Bihu or Kongaali Bihu and Magh Bihu or Bhogaali Bihu. The word 'Bihu' comes from the Sanskrit word 'Vishu'. The Bihus are closely associated with the farmer's life, which characterises ancient rural Assamese life. It marks three distinct phases in the cultivation of paddy-the native crop of Assam. Bohaag Bihu marks the advent of planting time, the Kati Bihu is celebrated at the completion of sowing season while Magh Bihu symbolises the culmination of harvesting period. Rongaali Bihu is the most important Bihu among the three Bihus. It is celebrated in the month of Bohaag, the first month of the Assamese calendar. Thus, the festival marks the advent of Assamese New year. Hence, it is characterized by lots of merriment, gaiety, songs and dance. The festival coincides with the arrival of spring season in the state providing greater reason for merriment. The nature is in its finest form fully adorned with blossoms and flowers. Therefore, this Bihu is known as Rongaali Bihu or the festival of merriment ('Rong' means joy in Assamese). Bihu festivals are an integral part of Assamese life and culture. Bihu geet or Bihu songs constitute an important part of Assam's rich heritage and literature. The uniqueness of Bihu celebrations is that they are celebrated by everyone in Assam irrespective of caste, creed, or race. The festivals are true community festivals and promote a sprit of love, brotherhood and sense of oneness among the people. It is therefore, the duty of every Assamese to preserve these national festivals in their original form and grandeur."
    },
    {
      "test_number": 21,
      "title": "SSC CGL Previous Year Typing Test - 21",
      "passage": "Social environment is influenced by one's power and wealth. This, in turn, determines success or failure in peoples' lives. If one were born with a silver spoon in his mouth, he would easily be able to attend a fancy school no matter how intelligent he is or have any luxury he wants just because of power and wealth. On the flip side, if one were born to a poor family in a bad neighbourhood infested with violence and drugs, he would have a much smaller chance of succeeding in life, more especially, going to an upper-class school. It is hard for many poor to go to college because of such high tuition costs. Scholarships are available; but, even though one shows financial need, one still has to have a high grade point average and test scores. Even if one has a good mind, trying to study in a gang- ridden neighbourhood with constant gunfire isn't easy. With both parents working two jobs, there isn't any parental guidance. Whereas, the affluent, even if busy or working, have the means to insure that their children are supervised and well taken care of. The rich also have the luxury of affording special tutors to help their children while other children are on their own. For example, there are three students, one from a clean, upper-class community, another from a small, middle-class suburb and the other from a graffiti-ridden slum. All three of these students have exceptional GPA's and scored very well on standardised testing. The student from the upper-class community will have the best chance of succeeding. Tuition will never be a problem and chances are that those parents have some pull because of who they are. The middle-class student won't have a great problem but there is still the fact of paying tuition, which would limit the options quite a bit. One may be smart enough to get grants but the family makes too much money. Also, if he sought admission into a prestigious school and it came down to the student or someone richer, the middle-class student would probably lose out."
    },
    {
      "test_number": 22,
      "title": "SSC CGL Previous Year Typing Test - 22",
      "passage": "Reservation policy fails to achieve its purpose of giving equal opportunity to everyone because of lack of infrastructure in the rural areas of the country where the proportion of backward classes is significant. A number of people living in some remote areas in Orissa, M. P. or Bihar are not even aware of these policies. They are deprived of even primary education and basic employment which make them more backward financially. It fails to establish which causes disequilibrium in the status of the states. The total reservation quota stands at 49% in many states of India and this includes the SCs, STs and OBCs. The trend seems to have shifted to reverse discrimination rather than more affirmative action. Some backward class's elite have gained political and economic clout based on this reservation. However a majority of the backward classes is not living any differently than before because their subsistence is meagre and rural lifestyles do not provide them with any of the benefits. The worst thing is that many are not even aware of these policies, especially in the interior parts of the nation. Thus a distinct economic class system exists within the backward classes. Mostly undeserving people have gained the advantages and the deserving ones are still without any significant positive change in their plight. It is interesting to note that the constitutional provisions regarding reservations which explicitly single out certain castes for special preferential treatment contradicts the documents prohibition on discrimination based on caste, race and other such other criteria. Besides, despite the creation of commissions to monitor the implementation of reservation policy by the centre the constitution gives great liberties to the individual states to determine the quantity and limits of reservation which often lead to exploitation. In reality there is no abolishment of caste system. Instead the disparity increases because of antagonistic attitude on both sides."
    },
    {
      "test_number": 23,
      "title": "SSC CGL Previous Year Typing Test - 23",
      "passage": "It is said that around 3.7 billion years ago, the earth cooled down and had warm oceans. In these warm water bodies, the first single-celled organisms evolved. Thus, water was instrumental in the origin of life. 70% of the earth is covered with water, and up to 70% of the human body is made of water. Today we have millions of marine species, but many plants and animals evolved to survive in non-saline conditions. The human civilization rose on the banks of rivers. Early human beings settled down along the fertile river basins as it was easy for growing crops, and was convenient for transportation too. Presently, agriculture demands for 70% of the freshwater needs. Industries and domestic uses share the rest thirty percent. But this precious resource has become scarce due to many human-made reasons. Only three percent of the total water available is freshwater. But more than sixty percent of this potable water is locked up in ice caps and glaciers. Moreover, we haven't kept our water bodies clean. Industrial effluents and sewage discharges are directly let into rivers. In cities, buildings come up on dried ponds and lakes. So, when it rains, we don't have the facility to store the rainwater. Therefore, we not only have frequent flash floods, but the rainwater goes to the sea and gets wasted. We use the fertile soil from riverbeds carelessly, and it leads to flooding in riverine areas too. So, we humans are primarily responsible for reducing the holding capacity of water bodies. We live in concrete jungles, and a green cover is almost missing in our cities. It is the roots of trees that help in retention of groundwater. Moreover, plants release oxygen and absorb carbon dioxide. Thus, they are instrumental in curbing global warming. Lesser warming implies a slower melting of ice sheets and glaciers, thereby, preserving the largest source of freshwater. Floods and storms are natural events, but nature has its way of replenishing the water that flows into the seas."
    },
    {
      "test_number": 24,
      "title": "SSC CGL Previous Year Typing Test - 24",
      "passage": "Holi is one of the important festivals of the Hindus. It is a colorful festival of great joy and enthusiasm. This festival is celebrated all over the country as a day filled with complete mischief, fun and enjoyment. Holi indicates the end of the winters and the beginning of the spring season. According to the Hindu calendar it is celebrated on the full-moon night of the month of Phalgun. Holi is celebrated to mark the victory of truth over evil, the victory of Prahlad over King Hiranyakashyap. Prahlad was a devotee of God. His father, King Hiranyakashyap did not believe in God but-believed in his own powers. He failed to deviate his son's devotion to God and decided to kill him by burning him alive. Prahlad's sister, Holika, had a God-gifted boon that she would not be burnt in the fire. She sat with her nephew in the blazing fire. Holika let herself be burnt and Prahlad was saved. The truth, the powers of the Supreme God, defeated the false evil. During the day women folk worship a stack of wooden logs called Holi. At the end of the day in the full-moon night Holi is burnt in a holy way. The green ears of barley and gram are heated up in the fire and distributed among friends and relatives new. Friendships are made and old enmities are forgotten. Next day is the festive day of Holi. All hearts are filled with joy. Children throw colored water on each other while the elder people apply 'gulal' or 'abir', There are noisy scenes as little groups of children move from one locality to another exchanging holi greetings, singing songs and laughing at their own jokes. It is almost mid-day when people move indoors to freshen themselves. Though this is a festival of brotherhood and unity, it has some disadvantages too. Some ill-minded people-take this day as a chance to take revenge. They use dirty mud water. Use of strong colors harmful to the skin, charcoal and grease often create a serious quarrel. This leads to unnecessary enmity and spoils the charm of the festival."
    },
    {
      "test_number": 25,
      "title": "SSC CGL Previous Year Typing Test - 25",
      "passage": "The average temperature of the Earth has been increasing continually since the late 19th century. The mean global temperature in the 1960s was 13.9 degree Celsius whereas in 2017 it was 14.9 degree Celsius. Thus, no one can deny the fact that the temperatures have been rising on our planet. Ice ages and warmer periods have occurred alternatively and naturally on Earth. Natural warming happens when Earth is closer to the Sun. But, it is the greenhouse gases that lead to a rapid temperature increase and disrupt the natural cycle of changes. The gases such as the oxides of carbon and sulfur are greenhouse gases. These gases, when present in the atmosphere, trap the incoming radiation and heat from the Sun. The phenomenon of atmospheric gases acting as a shield is known as the greenhouse effect. We humans have been primarily responsible for the release of these harmful gases. Our activities such as industrial production, petroleum extraction, transportation, burning fossil fuel, mining, cattle rearing, and deforestation are primarily responsible for global warming. The first impact of global warming is the melting of polar ice caps and glaciers. So, a loss of habitat for species in the frozen zone is likely. Losing tones of ice could result in the rising of sea levels, and inundation of coastal areas all over the world. Glaciers are the sources of our rivers. With no glaciers, many rivers could dry up, leading to severe water scarcity. As individuals, we too have the responsibility in making our planet a safe abode for our future generations. We should go for energy-efficient lights such as LED bulbs that don't generate much heat. We can drive less and use public transport instead. Recycling has to become a habit in our society as the production of new components takes lots of energy and leads to pollution too. Make judicious use of natural resources such as water. Plant trees as a single tree can absorb one ton of carbon dioxide over its lifetime. We should also use less electronic devices for recreational purposes."
    },
    {
      "test_number": 26,
      "title": "SSC CGL Previous Year Typing Test - 26",
      "passage": "We live in a world where Alexa plays the music in the living room, and Siri sets the alarm on the phone. Not far is the day when most of us will have robots in our homes, loading the dishwasher and assembling our furniture. We already have drones, and experiments on driverless cars are going on. Computers are vital in the communication and transportation industries. They control our satellites and traffic signals. Through Big data and analytics, companies make business decisions. Technologies like Artificial Intelligence, Machine Learning, and IoT (Internet of Things) could bring a sea of changes in our daily lives. A range of industries right from agriculture, textiles to our defense field is highly dependent on computer technology. There does not exist a sector, which is untouched by the magic of computers. Computers, smart phones, and cheap internet data packs have revolutionized the field of education. A data-enabled mobile phone opens the door to vast resources. Online learning and distance education have changed the fortunes of many. The software programs are better than print media in presenting the subject to the students. In this way, they are more interested in learning and take initiatives to know further. It increases the quality of education that people receive. Moreover, computers have vast storage spaces, and the durability of the study material is also high. In specific fields like architecture and mechanical engineering, there is a paradigm shift in pedagogy. They learn and use software technologies like CAD and CAM. We know that the word 'computer' comes from compute and thus, they were mostly computing devices. The first computer was for the military, and the U.S. army used it for calculating artillery firing tables. Today, computers are used in tanks, planes, and ships to target enemy forces. They play a vital role in providing training and simulations to soldiers. They are essential to safeguard the confidential activities of the defense forces."
    },
    {
      "test_number": 27,
      "title": "SSC CGL Previous Year Typing Test - 27",
      "passage": "In early second millennium BCE persistent drought caused the population of the Indus Valley to scatter from large urban centres to villages. Around the same time, Indo-Aryan tribes moved into the Punjab from regions further northwest in several waves of migration. The resulting Vedic period was marked by the composition of the Vedas, large collections of hymns of these tribes whose postulated religious culture, through synthesis with the preexisting religious cultures of the subcontinent, gave rise to Hinduism. The caste system, which created a hierarchy of priests, warriors, and free peasants arose later during this period. Towards the end of the period, around 600 BCE, after the pastoral and nomadic Indo-Aryans spread from the Punjab into the Gangetic plain, large swaths of which they deforested to pave way for agriculture, a second urbanisation took place. The numerous Indo-Aryan realms, or janapadas, were consolidated into larger states, or mahajanapadas. This urbanisation was accompanied by the rise of new ascetic movements, including Jainism and Buddhism, which challenged the primacy of rituals, presided by Brahmin priests, that had come to be associated with Vedic religion, and gave rise to new religious concepts. Most of the Indian subcontinent was conquered by the Maurya Empire during the 4th and 3rd centuries BCE. From the 3rd century BCE onwards Prakrit and Pali literature in the north and the Tamil Sangam literature in southern India started to flourish. Wootzsteel originated in south India in the 3rd century BCE and was exported to foreign countries. During the Classical period, various parts of India were ruled by numerous dynasties for the next 1,500 years, among which the Gupta Empire stands out. This period, witnessing a Hindu religious and intellectual resurgence, is known as the classical or \"Golden Age of India\". During this period, aspects of Indian civilisation, administration, culture, and religion spread to much of Asia, while kingdoms in southern India had maritime business links with the Middle East and the Mediterranean."
    },
    {
      "test_number": 28,
      "title": "SSC CGL Previous Year Typing Test - 28",
      "passage": "A voyaging ship was wrecked during a storm at sea and only two of the men on it were able to swim to a small, desert like island. The two survivors who have been good friends, not knowing what else to do, agreed that they had no other recourse but to pray to God. However, to find out whose prayer was more powerful, they agreed to divide the territory between them and stay on opposite sides of the island. The first thing they prayed for was food. The next morning, the first man saw a fruit-bearing tree on his side of the land, and he was able to eat its fruit. The other man's parcel of land remained barren. After a week, the first man was lonely and he decided to pray for a wife. The next day, another ship was wrecked, and the only survivor was a woman who swam to his side of the land. On the other side of the island, there was nothing. Soon the first man prayed for a house, clothes, more food. The next day, like magic, all of these were given to him. However, the second man still had nothing. Finally, the first man prayed for a ship, so that he and his wife could leave the island. In the morning, he found a ship docked at his side of the island. The first man boarded the ship with his wife and decided to leave the second man on the island. He considered the other man unworthy to receive God's blessings since none of his prayers had been answered. As the ship was about to leave, the first man heard a voice from heaven booming, \"Why are you leaving your companion on the island?\" \"My blessings are mine alone since I was the one who prayed for them,\" the first man answered. \"His prayers were all unanswered and so he does not deserve anything.\" \"You are mistaken!\" the voice rebuked him. \"He had only one prayer, which I answered. If not for that, you would not have received any of my blessings.\" \"Tell me,\" the first man asked the voice, \"What did he pray for that...\""
    },
    {
      "test_number": 29,
      "title": "SSC CGL Previous Year Typing Test - 29",
      "passage": "Sports in School for Kids - A student, who is good in sports as well as in academics, develops an overall personality which is reflected in his or her life. It gives him strength, a sense of discipline and how to associate with other players. School sports make school life more interesting also. Now-a-days all the colleges and schools have sports as a parts of compulsory curriculum. So for this purpose schools have big playgrounds. They have big playgrounds to accommodate games like football, hockey and cricket. Some schools also provide their students games like basketball, volleyball, table tennis, lawn tennis and badminton. School sports play a very important role in teaching a student team spirit. They teach a student to play the game for the sake of playing and not for the sake of winning. So spirit of healthy competition and discipline is taught to the students. Some schools even have gymnasium to develop a child's physique and mind. A student can apply the sportsman spirit in his everyday life also and learn to accept defeats with a smile. Sports also teach us that practice makes a man perfect and hard work really pays in the end. School and college sports also help the student to choose career in sports itself. They can become professional sportsman. Sports also help students in careers in Armed Forces. So school sports should be encouraged and concerned authorities should see to it that schools make proper provision for this. A House on Fire for Kids - It was a dry day and it was night. The clock on the tower had struck twelve. I was sleeping on the roof of my house. Suddenly I heard shouts of \"Fire, Fire!\" I woke up at once and looked out in the street. I saw a house on fire. It was at some distance away from my house. I ran downstairs and reached the place. Many people had collected there. They were trying to put out the fire. They were throwing water and sand on it. But it did not prove of much help. A strong wind was blowing. Some cries were heard from inside the house. The house belonged to a keeper."
    }
  ]
}
